In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('ecommerce.csv')
df.head()

,customer_id,age,gender,country,signup_date,last_purchase_date,num_orders,total_spent,avg_order_value,recency_days,is_premium_member,device_type,preferred_category,churned
0,10001,56.0,Male,India,2022-01-27,2024-04-27,10,13273.25,1327.32,522,0,NaN,Home,0
1,10002,69.0,Other,UK,2025-01-12,2025-08-01,10,NaN,308.90,61,0,Mobile,Grocery,0
2,10003,46.0,Female,USA,2021-04-25,2021-06-01,5,3411.83,682.37,1583,0,NaN,NaN,0
3,10004,32.0,Male,India,2021-02-23,2023-09-22,5,4502.00,900.40,740,0,NaN,NaN,0
4,10005,60.0,Female,India,2021-06-07,2021-12-11,7,3842.10,548.87,1390,0,Tablet,Books,0

In [3]:
df.describe() ###statistical summary of numerical columns

,customer_id,age,num_orders,total_spent,avg_order_value,recency_days,is_premium_member,churned
count,605.000000,577.000000,605.000000,571.000000,605.000000,605.000000,605.000000,605.000000
mean,10301.439669,44.175043,5.945455,8059.212137,1279.377471,456.029752,0.294215,0.036364
std,173.636071,14.978765,2.332892,10346.781856,1123.841840,405.810389,0.456066,0.187348
min,10001.000000,18.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000
25%,10151.000000,32.000000,4.000000,3920.640000,795.780000,128.000000,0.000000,0.000000
50%,10302.000000,45.000000,6.000000,6533.980000,1152.530000,327.000000,0.000000,0.000000
75%,10451.000000,56.000000,7.000000,9523.010000,1615.030000,696.000000,1.000000,0.000000
max,10600.000000,69.000000,13.000000,123891.810000,11431.900000,1685.000000,1.000000,1.000000

In [4]:
df.dtypes

customer_id             int64
age                   float64
gender                 object
country                object
signup_date            object
last_purchase_date     object
num_orders              int64
total_spent           float64
avg_order_value       float64
recency_days            int64
is_premium_member       int64
device_type            object
preferred_category     object
churned                 int64
dtype: object

In [5]:
##handling missing values
df.isnull().any(axis=1) ##rowwise

0       True
1       True
2       True
3       True
4      False
       ...
600     True
601    False
602    False
603    False
604    False
Length: 605, dtype: bool

In [6]:
df.isnull().any()##columnwise

customer_id           False
age                    True
gender                 True
country                True
signup_date           False
last_purchase_date    False
num_orders            False
total_spent            True
avg_order_value       False
recency_days          False
is_premium_member     False
device_type            True
preferred_category     True
churned               False
dtype: bool

In [7]:
df.isnull().sum()

customer_id            0
age                   28
gender                34
country               32
signup_date            0
last_purchase_date     0
num_orders             0
total_spent           34
avg_order_value        0
recency_days           0
is_premium_member      0
device_type           30
preferred_category    22
churned                0
dtype: int64

In [8]:
df_filled = df.fillna(0) ###filling missing values with 0
df_filled.head()

,customer_id,age,gender,country,signup_date,last_purchase_date,num_orders,total_spent,avg_order_value,recency_days,is_premium_member,device_type,preferred_category,churned
0,10001,56.0,Male,India,2022-01-27,2024-04-27,10,13273.25,1327.32,522,0,0,Home,0
1,10002,69.0,Other,UK,2025-01-12,2025-08-01,10,0.00,308.90,61,0,Mobile,Grocery,0
2,10003,46.0,Female,USA,2021-04-25,2021-06-01,5,3411.83,682.37,1583,0,0,0,0
3,10004,32.0,Male,India,2021-02-23,2023-09-22,5,4502.00,900.40,740,0,0,0,0
4,10005,60.0,Female,India,2021-06-07,2021-12-11,7,3842.10,548.87,1390,0,Tablet,Books,0

In [9]:
###filling missing values with mean of the column
df['total_spent_fillna'] = df['total_spent'].fillna(df['total_spent'].mean())
df.head()

,customer_id,age,gender,country,signup_date,last_purchase_date,num_orders,total_spent,avg_order_value,recency_days,is_premium_member,device_type,preferred_category,churned,total_spent_fillna
0,10001,56.0,Male,India,2022-01-27,2024-04-27,10,13273.25,1327.32,522,0,NaN,Home,0,13273.250000
1,10002,69.0,Other,UK,2025-01-12,2025-08-01,10,NaN,308.90,61,0,Mobile,Grocery,0,8059.212137
2,10003,46.0,Female,USA,2021-04-25,2021-06-01,5,3411.83,682.37,1583,0,NaN,NaN,0,3411.830000
3,10004,32.0,Male,India,2021-02-23,2023-09-22,5,4502.00,900.40,740,0,NaN,NaN,0,4502.000000
4,10005,60.0,Female,India,2021-06-07,2021-12-11,7,3842.10,548.87,1390,0,Tablet,Books,0,3842.100000

In [10]:
## renaming columns
df_renamed = df.rename(columns={'total_spent':'total_amount_spent'})
df_renamed.head()

,customer_id,age,gender,country,signup_date,last_purchase_date,num_orders,total_amount_spent,avg_order_value,recency_days,is_premium_member,device_type,preferred_category,churned,total_spent_fillna
0,10001,56.0,Male,India,2022-01-27,2024-04-27,10,13273.25,1327.32,522,0,NaN,Home,0,13273.250000
1,10002,69.0,Other,UK,2025-01-12,2025-08-01,10,NaN,308.90,61,0,Mobile,Grocery,0,8059.212137
2,10003,46.0,Female,USA,2021-04-25,2021-06-01,5,3411.83,682.37,1583,0,NaN,NaN,0,3411.830000
3,10004,32.0,Male,India,2021-02-23,2023-09-22,5,4502.00,900.40,740,0,NaN,NaN,0,4502.000000
4,10005,60.0,Female,India,2021-06-07,2021-12-11,7,3842.10,548.87,1390,0,Tablet,Books,0,3842.100000

In [11]:
##changing data types
df['age']= df['age'].fillna(df['age'].mean()).astype(int)

df

,customer_id,age,gender,country,signup_date,last_purchase_date,num_orders,total_spent,avg_order_value,recency_days,is_premium_member,device_type,preferred_category,churned,total_spent_fillna
0,10001,56,Male,India,2022-01-27,2024-04-27,10,13273.25,1327.32,522,0,NaN,Home,0,13273.250000
1,10002,69,Other,UK,2025-01-12,2025-08-01,10,NaN,308.90,61,0,Mobile,Grocery,0,8059.212137
2,10003,46,Female,USA,2021-04-25,2021-06-01,5,3411.83,682.37,1583,0,NaN,NaN,0,3411.830000
3,10004,32,Male,India,2021-02-23,2023-09-22,5,4502.00,900.40,740,0,NaN,NaN,0,4502.000000
4,10005,60,Female,India,2021-06-07,2021-12-11,7,3842.10,548.87,1390,0,Tablet,Books,0,3842.100000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
600,10358,25,Female,India,2023-09-04,2025-06-18,7,NaN,0.00,105,1,Mobile,Electronics,0,8059.212137
601,10117,50,Male,USA,2024-05-11,2024-11-08,4,3640.07,910.02,327,0,Mobile,Electronics,0,3640.070000
602,10599,46,Male,India,2020-12-01,2024-06-25,6,2176.22,362.70,463,1,Desktop,Electronics,0,2176.220000
603,10442,32,Female,UK,2023-12-20,2024-09-20,3,5478.65,1826.22,376,0,Mobile,Home,0,5478.650000
604,10555,44,Female,Germany,2024-06-16,2024-12-09,6,5408.13,901.36,296,0,Mobile,Fashion,0,5408.130000

In [12]:
df['new_value'] = df['age'].apply(lambda x: x*2)
df.head()

,customer_id,age,gender,country,signup_date,last_purchase_date,num_orders,total_spent,avg_order_value,recency_days,is_premium_member,device_type,preferred_category,churned,total_spent_fillna,new_value
0,10001,56,Male,India,2022-01-27,2024-04-27,10,13273.25,1327.32,522,0,NaN,Home,0,13273.250000,112
1,10002,69,Other,UK,2025-01-12,2025-08-01,10,NaN,308.90,61,0,Mobile,Grocery,0,8059.212137,138
2,10003,46,Female,USA,2021-04-25,2021-06-01,5,3411.83,682.37,1583,0,NaN,NaN,0,3411.830000,92
3,10004,32,Male,India,2021-02-23,2023-09-22,5,4502.00,900.40,740,0,NaN,NaN,0,4502.000000,64
4,10005,60,Female,India,2021-06-07,2021-12-11,7,3842.10,548.87,1390,0,Tablet,Books,0,3842.100000,120

In [13]:
###data aggregating and grouping
df.groupby('country')['total_spent'].mean()

country
Australia    7300.389762
Canada       6912.924464
Germany      7344.417027
India        8608.820344
UK           6460.716857
USA          8690.467722
Name: total_spent, dtype: float64

In [14]:
df.groupby(['country','device_type'])['total_spent'].sum()

country    device_type
Australia  Desktop          77856.16
           Mobile          201959.00
Canada     Desktop         124472.79
           Mobile          239452.55
           Tablet           10648.67
Germany    Desktop          53458.05
           Mobile          218285.38
India      Desktop         409837.13
           Mobile         1898546.11
           Tablet           71488.77
UK         Desktop          72029.15
           Mobile          135183.59
           Tablet           18912.35
USA        Desktop         132078.07
           Mobile          454430.58
           Tablet           30235.85
Name: total_spent, dtype: float64

In [18]:
###aggregate multiple functions
grouped_agg = df.groupby('country')['total_spent'].agg(['mean', 'sum', 'count'])
grouped_agg

                  mean         sum  count
country
Australia  7300.389762   306616.37     42
Canada     6912.924464   387123.77     56
Germany    7344.417027   271743.43     37
India      8608.820344  2505166.72    291
UK         6460.716857   226125.09     35
USA        8690.467722   686546.95     79

In [19]:
##merging and joining dataframes
df1 = pd.DataFrame({
    'customer_id':[1,2,3,4],
    'customer_name':['Alice', 'Bob', 'Charlie', 'David']
})
df2 = pd.DataFrame({
    'customer_id':[1,2,3,5],
    'total_spent':[250, 150, 300, 400]
})

In [22]:
##merging on customer_id columns
pd.merge(df1, df2, on='customer_id', how='inner')

   customer_id customer_name  total_spent
0            1         Alice          250
1            2           Bob          150
2            3       Charlie          300

In [ ]:
pd.merge(df1, df2, on='customer_id', how='outer') ###outer join

   customer_id customer_name  total_spent
0            1         Alice        250.0
1            2           Bob        150.0
2            3       Charlie        300.0
3            4         David          NaN
4            5           NaN        400.0

In [24]:
pd.merge(df1, df2, on='customer_id', how='left')

   customer_id customer_name  total_spent
0            1         Alice        250.0
1            2           Bob        150.0
2            3       Charlie        300.0
3            4         David          NaN

In [25]:
pd.merge(df1, df2, on='customer_id', how='right')

   customer_id customer_name  total_spent
0            1         Alice          250
1            2           Bob          150
2            3       Charlie          300
3            5           NaN          400